registrarProducto.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <RegistrarProductoRequest xmlns="t4is.uv.mx/saludos">
            <id>123</id>
            <nombre>caballos</nombre>
            <descripcion>caballo enfierrado</descripcion>
            <precio>45</precio>
            <cantidad>23</cantidad>
        </RegistrarProductoRequest>
    </Body>
</Envelope>